app/Http/helpers.php

function LangUser ($lang) {

if (!$lang) {
    if (!\Cookie::get('LANGIMCTGroup')) {
    \Cookie::queue('LANGIMCTGroup', config('settings.DefaultLanguage') );
    $langUser = config('settings.DefaultLanguage');
    \App::setLocale(config('settings.DefaultLanguage'));
     } else {
    $langUser = \Cookie::get('LANGIMCTGroup' );
    \App::setLocale($langUser);
     }

    } else {
    \Cookie::forget('LANGIMCTGroup');
    if(in_array($lang, \App\Language::pluck('code')->toArray())) {
---
select `code` from `languages` where `languages`.`deleted_at` is null