app/User.php

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = '1'
---
     public function assign($role) {

        if (is_string($role)) {

        return $this->roles()->save( Role::WhereName($role)->firstOrFail() );