app/Providers/AppServiceProvider.php

select * from `permissions` where `is_menu` = '1' order by `order_list` asc
---
    public function boot()
{


//frontend
app('view')->composer('*', function ($view) {
        $AppLangUser = LangUser(\App::getLocale());
        $view->with(compact('AppLangUser'));
    });

app('view')->composer('*', function ($view) {
        $AppLanguagesHeader = \App\Language::Languagelist();
        $view->with(compact('AppLanguagesHeader'));
    });


//backend
app('view')->composer('backend.includes.sidebar', function ($view) {
        $sidebar_menus = \App\Permission::whereIsMenu(2)->orderBy('order_list','ASC')->get();
        $view->with(compact('sidebar_menus'));
});