app/Http/Controllers/Backend/CustomersController.php

  public function index(Request $request)
  {


    if ( Gate::denies(['customers'])  ) { abort(404); }
    $data = Customers::paginate(10);
---
select * from `customers` limit 10 offset 0
select count(*) as aggregate from `customers`

public function edit($id)
{
  if ( Gate::denies(['customers','update_customers'])  ) { abort(404); }

  $data = Customers::find($id);
  $customers_cases = CustomersCases::pluck('title','id');
  $sales_channels = SalesChannels::pluck('title','id');
  $commercial_activities = CommercialActivities::pluck('title','id');
  $ages = AgeCtegories::pluck('title','id');
  $diseases = Diseases::pluck('title','id');
  $doctors = Doctors::pluck('name','id');
  $assessment_questions = AssessmentQuestions::whereStatus(1)->get();
---
select * from `customers` where `customers`.`id` = '1' limit 1
select `title`, `id` from `customers_cases`
select `title`, `id` from `sales_channels`
select `title`, `id` from `commercial_activities`
select `title`, `id` from `diseases`
select `name`, `id` from `doctors`
select * from `assessment_questions` where `status` = '1'