app/Http/Controllers/Backend/DriverController.php

  public function index(Request $request)
  {
   // if ( Gate::denies(['drivers'])  ) { abort(404); }

    $drivers = User::orderby('id','desc')->where('role' , 'driver')->with('driver')->paginate(30);
---
select * from `drivers` where `drivers`.`user_id` in ('6')
select * from `users` where `role` = 'driver' order by `id` desc limit 30 offset 0
select count(*) as aggregate from `users` where `role` = 'driver'