app/Http/Controllers/Backend/HomeController.php

    public function index(Request $request , $lang = null)
    {
$lang = LangUser($lang);
$totalSuppliers = Supplier::where('status',1)->count();
$totalMotherProducts = MotherProducts::where('status',1)->count();
$totalCategories = Categories::where('status',1)->count();
$totalBrands = Brands::where('status',1)->count();
$totalProducts = Products::count();
$products_data = Products::latest()->take(10)->get();
$totalCoupons = Coupons::groupBy('title')->get();
$totalAssessment = CustomersAssessmentProducts::groupBy('customer_id')->get();
---
select count(*) as aggregate from `suppliers` where `status` = '1'
select count(*) as aggregate from `mother_products` where `status` = '1'
select count(*) as aggregate from `categories` where `status` = '1'
select count(*) as aggregate from `brands` where `status` = '1'
select count(*) as aggregate from `products`
select * from `products` order by `created_at` desc limit 10
select * from `coupons` group by `title`
select * from `customers_assessment_products` group by `customer_id`