app/Http/Controllers/Backend/OrderController.php

select * from `orders`
---
    public function index(Request $request)
    {
//        if (Gate::denies(['orders'])) {
//            abort(404);
//        }

        $data = Order::get();

select `name`, `id` from `users` where `role` = 'driver'
select `title`, `id` from `cities`
select `title`, `id` from `branches`
select * from `customers`
---
    public function create(Request $request)
    {
        //if ( Gate::denies(['create_orders'])  ) { abort(404); }
        $drivers = User::where('role','driver')->pluck('name','id');
        $cities = City::pluck('title', 'id');
        $branches = Branch::pluck('title', 'id');
        $customers = Customers::all();