app/Http/Controllers/Backend/ProductsController.php

select `title`, `serial` from `categories` where `status` = '1'
select `title`, `id` from `types` where `status` = '1'
select `title`, `id` from `units` where `status` = '1'
select *, `title` as `title` from `brands` where `status` = '1'
select *, `title` as `title` from `websites` where `status` = '1'
select * from `suppliers` where `status` = '1'
select * from `products`
select `title_ar`, `id` from `repositories` where `status` = '1'
select `title`, `id` from `coupons` where `status` = '1'
select * from `quantity_prices`
---
   public function create( $lang = null )
  {
 if ( Gate::denies(['products','create_products'])  ) { abort(404); }

 $lang = LangUser($lang);

 if($lang == 'ar'){
   $title = 'title';
 }else{
  $title = 'title_'.$lang;
 }

 if ( $title == 'title_') {
  $title = 'title';
 }


  $categories = Categories::where('status' , 1)->pluck( $title , 'serial');
  $types = Types::where('status' , 1)->pluck('title' , 'id');
  $units = Units::where('status' , 1)->pluck('title' , 'id');
  $brands = Brands::where('status' , 1)->select('*',  $title .' as title')->get();
  $websites = Websites::where('status' , 1)->select('*',  $title .' as title')->get();
  $last_serial = "01";
  $suppliers = Supplier::where('status' , 1)->get();
  $all_products = Products::get();
  $repositories = Repositories::where('status' , 1)->pluck('title_ar' , 'id');
  $coupons = Coupons::where('status' , 1)->pluck('title' , 'id');
  $quantity_prices = QuantityPrices::get();

select count(*) as aggregate from `products`
select * from `products` order by `id` asc limit 10 offset 0
---
  public function all_products(Request $request)
    {

        $columns = array(
                            0 =>'id',
                            1 =>'title_ar',
                            2=> 'title_en',
                            3=> 'sku',
                            4=>'category_id',
                            5=> 'id',
                        );


        $totalData = Products::count();
        $totalFiltered = $totalData;

        $limit = $request->input('length');
        $start = $request->input('start');
        $order = $columns[$request->input('order.0.column')];
        $dir = $request->input('order.0.dir');


        $posts = Products::query();


        if(empty($request->input('search.value')))
        {

            $posts = $posts->offset($start)
                         ->limit($limit)
                         ->orderBy($order,$dir)
                         ->get();